         [{
                 "price": "19 грн.",
                 "name": "Чікен Бургер",
                 "description": "Найсмачніша соковита курятина – приготована на грилі,соковита куряча котлета,соковиті томати,свіжа пекінська капуста і ніжний пікантний соус у гарячій рум\"яній булочці.Справжнє задоволення !!!"
             },
             {
                 "price": "24,50 грн.",
                 "name": "Чіз Бургер",
                 "description": "Нехай життя буде ще більш сонячним та радісним разом з чізбургером від Family Burger! Фірмове поєднання приготованої на грилі соковитої курячої котлети із злегка розплавленим бутербродним сиром, свіжа пекінська капуста, соковиті помідори і ніжний пікантний соус. Яскраве поєднання смаку та прянощів!"
             },
             {
                 "price": "34 грн.",
                 "name": "Кріспі Бургер",
                 "description": "Соковите цільне куряче філе приготоване на вогню разом з солоними огірочками, томатами, свіжою пекінською капустою, під гострим соусом Табаско. Вишуканий смак!"
             },
             {
                 "price": "30,50 грн.",
                 "name": "Делюкс Бургер",
                 "description": "Неймовірно,неймовірно барвистий і апетитний бургер із соковитим курячим філе в хрусткій паніровці, зі свіжими огірками, та томатами під пікантним часниковим соусом в м\"якій булочці з кунжутом…. Радісний смак літа!!!"
             },
             {
                 "price": "35 грн.",
                 "name": "Дабл Чізбургер",
                 "description": "Величезне задоволення! Чим більше – тим краще! Саме тому, в нашому Дабл чізбургері  аж дві соковиті курячі котлети обсмажені на грилі,та аж два злегка розплавлених бутербродних сира, а також стиглі томати, свіжа пекінська капуста і ніжний пікантний соус у гарячій рум\"яній булочці.  Даблчізбургер – коли звірячий апетит!"
             },
             {
                 "price": "19 грн.",
                 "name": "Смажені гомілки",
                 "description": "Шматочок золотистої курочки улюблений з самого дитинства, соковитий всередині, хрусткий зовні. Промаринований у східних спеціях за рецептом <br>Family Burger – наша фірмова страва."

             },
             {
                 "price": "8 грн.",
                 "name": "Смажені крильця",
                 "description": "Обсмажені в рослинному фритюрі курячі крила в пікантній оригінальній паніровці. Соковиті в середині, хрусткі зовні. Чудово підійдуть як закуска до обіду або пива ммм... Неймовірно смачно..."

             },
             {
                 "price": "13,25 грн.",
                 "name": "Картопля Фрі",
                 "description": "Легендарна картопля фрі – з апетитною хрусткою скоринкою та м’якою, розсипчастою серединкою."

             },
             {
                 "price": "79,50 грн.",
                 "name": "Піца Чіз Квадро",
                 "description": "Склад: вершковий соус, сир пармезан, сир дорблю, сир моцарелла, сир голандський , заправка, легка граціозність."
             },
             {
                 "price": "49,99 грн.",
                 "name": "Піца Маргаріта",
                 "description": "Склад: соус,сир твердий, помідори, заправка, настоянка ніжності."
             },
             {
                 "price": "74 грн.",
                 "name": "Піца Гавайська",
                 "description": "Склад: соус, куряче філе, сир, печериці, ананаси, заправка, гарний настрій."
             },
             {
                 "price": "68 грн.",
                 "name": "Піца Карбонара",
                 "description": "Склад: соус, шинка, бекон, сир, печериці, маслини, кукурудза, позитивні думки."
             },
             {
                 "price": "75 грн.",
                 "name": "Піца Капоне",
                 "description": "Склад: соус томатний, шинка, сир, печериці, болгарський перець, вершковий соус, нотки чарівності."
             },
             {
                 "price": "68,50 грн.",
                 "name": "Піца Кантрі",
                 "description": "Склад: соус, куряче філе, сир Голандський, сир Фета, помідори, кукурудза, перець чілі, міцний дух."
             },
             {
                 "price": "85 грн",
                 "name": "Піца Фамілі",
                 "description": "Склад: соус, сир, Куряче філе,печериці, помідори, болгарський перець, кукурудза, ананас, родинне тепло."
             },
             {
                 "price": "67 грн.",
                 "name": "Піца Салямі",
                 "description": "Склад: соус томатний, мисливські ковбаски, салямі, сир, вершковий соус, смак перемоги."
             },
             {
                 "price": "35 грн.",
                 "name": "Чікен рол",
                 "description": "Закручений зі смаком! Шматочки золотистого курячого філе в хрусткій паніровці, з соковитою пекінською капустою, морква по-корейськи, пікантний часниковий соусом, загорнутий в пшеничний лаваш і підсмажений на грилі. Яскрава смакота!!!"
            },
             {
                 "price": "36 грн.",
                 "name": "Чіз рол",
                 "description": "Справжній Голандський сир та сир Моцарелла, з соковитою пекінською капустою, томатами, під сирним соусом, загорнутий в пшеничний лаваш і підсмажений на грилі. Дієтично, смачно, легко !!!"
            },
             {
                 "price": "36 грн.",
                 "name": "Стейк рол",
                 "description": "Золотистий курячий стейк приготований на вогню, соковита пекінська капуста, помідори, під гострим соусом Тобаско, та томатним кетчупом,  загорнутий в пшеничний лаваш і підсмажений на грилі. Шедевр смаку!!!"
            },
             {
                 "price": "30 грн.",
                 "name": "Цезар рол",
                 "description": "Смак соковитої золотистої курочки з ніжним сиром, , з соковитою пекінською капустою, томатами та пікантним Французьким соусом, загорнутий в пшеничний лаваш і підсмажений на грилі. Справжня насолода!!!"
            },
             {
                 "price": "29 грн.",
                 "name": "Грецький салат",
                 "description": "Грецький салат - це один з найлегших і низькокалорійних салатів, і при цьому він надзвичайно корисний та смачний! Назва в даному випадку повністю виправдовує себе - цей салат дійсно родом з Греції. Соковите листя салату, помідори, огірки, перець, ріпчаста цибуля, маслини, нарізаний кубиками сир заправлени олією і лимонним соком."
             },
             {
                 "price": "27 грн.",
                 "name": "Салат «Цезарь»",
                 "description": "Воістину знамените блюдо Салат, як і імператор, теж може одночасно виконувати кілька справ. Ніжне куряче філе так буде буквально танути на Ваших зубах, а хрускіт підсмажених сухариків безсумнівно, викличе у вас приплив сил, звичайно ж листи салату, свіжі овочі. Все це, посипане повітряними пластівцями сиру і заправлене соусом, що витончено передає любов, з якою наш кухар готує свій твір мистецтва."
             }
         ]